define([], function() {

	var greek_keys = {
		// Allows us to insert-in-order key combinations for lookup
		// Based on how we organized our dictionary. Here: Caps, Breathing, Accent, Subscript.
		"keyPriorities": ["⇧", "[", "]", "=", "`", "'", ","],
		"keyCodes": {
			"16": "⇧",
			"219": "[",
			"221": "]",
			"187": "=",
			"192": "`",
			"222": "'",
			"188": ",",
			"65": "a",
			"66": "b",
			"67": "c",
			"68": "d",
			"69": "e",
			"70": "f",
			"71": "g",
			"72": "h",
			"73": "i",
			"74": "j",
			"75": "k",
			"76": "l",
			"77": "m",
			"78": "n",
			"79": "o",
			"80": "p",
			"81": "q",
			"82": "r",
			"83": "s",
			"84": "t",
			"85": "u",
			"86": "v",
			"87": "w",
			"88": "x",
			"89": "y",
			"90": "z"
		},
		"dictionary": {
			"a" : "α",
			"b" : "β",
			"g" : "γ",
			"d" : "δ",
			"e" : "ε",
			"z" : "ζ",
			"h" : "η",
			"q" : "θ",
			"i" : "ι",
			"k" : "κ",
			"l" : "λ",
			"m" : "μ",
			"n" : "ν",
			"c" : "ξ",
			"o" : "ο",
			"p" : "π",
			"r" : "ρ",
			"s" : "σ",
			"t" : "τ",
			"u" : "υ",
			"f" : "φ",
			"x" : "χ",
			"y" : "ψ",
			"w" : "ω",
			"⇧": {
				"options": {
					"a" : "Α",
					"b" : "Β",
					"g" : "Γ",
					"d" : "Δ",
					"e" : "Ε",
					"z" : "Ζ",
					"h" : "Η",
					"q" : "Θ",
					"i" : "Ι",
					"k" : "Κ",
					"l" : "Λ",
					"m" : "Μ",
					"n" : "Ν",
					"c" : "Ξ",
					"o" : "Ο",
					"p" : "Π",
					"r" : "Ρ",
					"s" : "Σ",
					"t" : "Τ",
					"u" : "Υ",
					"f" : "Φ",
					"x" : "Χ",
					"y" : "Ψ",
					"w" : "Ω",

					"[": {
						"options": {
							"a": "Ἁ",
							"e": "Ἑ",
							"h": "Ἡ",
							"i": "Ἱ",
							"o": "Ὁ",
							"u": "Ὑ",
							"w": "Ὡ",
							"r": "Ῥ",

							"`": {
								"options": {
									"a": "Ἃ",
									"e": "Ἓ",
									"h": "Ἣ",
									"i": "Ἳ",
									"o": "Ὃ",
									"u": "Ὓ",
									"w": "Ὣ",

									",": {
										"options": {
											"a": "ᾋ",
											"h": "ᾛ",
											"w": "ᾫ"
										}
									}
								}
							},
							"'": {
								"options": {
									"a": "Ἅ",
									"e": "Ἕ",
									"h": "Ἥ",
									"i": "Ἵ",
									"o": "Ὅ",
									"u": "Ὕ",
									"w": "Ὥ",

									",": {
										"options": {
											"a": "ᾍ",
											"h": "ᾝ",
											"w": "ᾭ"
										}
									}
								}
							},
							"=": {
								"options": {
									"a": "Ἇ",
									"h": "Ἧ",
									"i": "Ἷ",
									"u": "Ὗ",
									"w": "Ὧ",

									",": {
										"options": {
											"a": "ᾏ",
											"h": "ᾟ",
											"w": "ᾯ"
										}
									}
								}
							},
						}
					},
					"]": {
						"options": {
							"a": "Ἀ",
							"e": "Ἐ",
							"h": "Ἠ",
							"i": "Ἰ",
							"o": "Ὀ",
							"w": "Ὠ",

							"`": {
								"options": {
									"a": "Ἂ",
									"e": "Ἒ",
									"h": "Ἢ",
									"i": "Ἲ",
									"o": "Ὂ",
									"w": "Ὢ",

									",": {
										"options": {
											"a": "ᾊ",
											"h": "ᾛ",
											"w": "ᾫ"
										}
									}
								}
							},
							"'": {
								"options": {
									"a": "Ἄ",
									"e": "Ἔ",
									"h": "Ἤ",
									"i": "Ἴ",
									"o": "Ὄ",
									"w": "Ὤ",

									",": {
										"options": {
											"a": "ᾌ",
											"h": "ᾜ",
											"w": "ᾬ"
										}
									}
								}
							},
							"=": {
								"options": {
									"a": "Ἆ",
									"h": "Ἦ",
									"i": "Ἶ",
									"w": "Ὦ",

									",": {
										"options": {
											"a": "ᾎ",
											"h": "ᾞ",
											"w": "ᾮ"
										}
									}
								}
							},
							",": {
								"options": {
									"a": "ᾈ",
									"h": "ᾘ",
									"w": "ᾨ"
								}
							}
						}
					},
					",": {
						"options": {
							"a": "ᾼ",
							"h": "ῌ",
							"w": "ῼ",
							"s": "ς"
						}
					},
					"`": {
						"options": {
							"a": "Ὰ",
							"h": "Ὴ",
							"e": "Ὲ",
							"i": "Ὶ",
							"o": "Ὸ",
							"w": "Ὼ",
						}
					},
					"'": {
						"options": {
							"a": "Ά",
							"h": "Ή",
							"e": "Έ",
							"i": "Ί",
							"o": "Ό",
							"u": "Ύ",
							"w": "Ώ",
						}
					}
				}
			},
			// START LOWERCASE
			"[": {
				"options": {
					"a": "ἁ",
					"e": "ἑ",
					"h": "ἡ",
					"i": "ἱ",
					"o": "ὁ",
					"u": "ὑ",
					"w": "ὡ",
					"r": "ῥ",

					"`": {
						"options": {
							"a": "ἃ",
							"e": "ἓ",
							"h": "ἣ",
							"i": "ἳ",
							"o": "ὃ",
							"u": "ὓ",
							"w": "ὣ",

							",": {
								"options": {
									"a": "ᾃ",
									"h": "ᾓ",
									"w": "ᾣ"
								}
							}
						}
					},
					"'": {
						"options": {
							"a": "ἅ",
							"e": "ἕ",
							"h": "ἥ",
							"i": "ἵ",
							"o": "ὅ",
							"u": "ὕ",
							"w": "ὥ",

							",": {
								"options": {
									"a": "ᾅ",
									"h": "ᾕ",
									"w": "ᾥ"
								}
							}
						}
					},
					"=": {
						"options": {
							"a": "ἇ",
							"h": "ἧ",
							"i": "ἷ",
							"u": "ὗ",
							"w": "ὧ",

							",": {
								"options": {
									"a": "ᾇ",
									"h": "ᾗ",
									"w": "ᾧ"
								}
							}
						}
					},
				}
			},
			"]": {
				"options": {
					"a": "ἀ",
					"e": "ἐ",
					"h": "ἠ",
					"i": "ἰ",
					"o": "ὀ",
					"u": "ὐ",
					"w": "ὠ",
					"r": "ῤ",

					"`": {
						"options": {
							"a": "ἂ",
							"e": "ἒ",
							"h": "ἢ",
							"i": "ἲ",
							"o": "ὂ",
							"u": "ὒ",
							"w": "ὢ",

							",": {
								"options": {
									"a": "ᾂ",
									"h": "ᾒ",
									"w": "ᾢ"
								}
							}
						}
					},
					"'": {
						"options": {
							"a": "ἄ",
							"e": "ἔ",
							"h": "ἤ",
							"i": "ἴ",
							"o": "ὄ",
							"u": "ὔ",
							"w": "ὤ",

							",": {
								"options": {
									"a": "ᾄ",
									"h": "ᾔ",
									"w": "ᾤ"
								}
							}
						}
					},
					"=": {
						"options": {
							"a": "ἆ",
							"h": "ἦ",
							"i": "ἶ",
							"u": "ὖ",
							"w": "ὦ",

							",": {
								"options": {
									"a": "ᾆ",
									"h": "ᾖ",
									"w": "ᾦ"
								}
							}
						}
					},
					",": {
						"options": {
							"a": "ᾀ",
							"h": "ᾐ",
							"w": "ᾠ"
						}
					}
				}
			},
			",": {
				"options": {
					"a": "ᾳ",
					"h": "ῃ",
					"w": "ῳ",
					"s": "ς"
				}
			},
			"=": {
				"options": {
					"a": "ᾶ",
					"h": "ῆ",
					"i": "ῖ",
					"u": "ῦ",
					"w": "ῶ",

					",": {
						"options": {
							"a": "ᾷ",
							"h": "ῇ",
							"w": "ῷ"
						}
					}
				}
			},
			"`": {
				"options": {
					"a": "ὰ",
					"h": "ὴ",
					"e": "ὲ",
					"i": "ὶ",
					"o": "ὸ",
					"w": "ὼ",

					",": {
						"options": {
							"a": "ᾲ",
							"h": "ῂ",
							"w": "ῲ"
						}
					}
				}
			},
			"'": {
				"options": {
					"a": "ά",
					"h": "ή",
					"e": "έ",
					"i": "ί",
					"o": "ό",
					"u": "ύ",
					"w": "ώ",

					",": {
						"options": {
							"a": "ᾴ",
							"h": "ῄ",
							"w": "ῴ"
						}
					}
				}
			}
		}
	};

	return greek_keys;

});
